#### TextRange Members

---

|  |
| --- |
| TextRange Class   Constructors   Methods   Properties   See Also |

The  TextRange  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TextRange | Constructs a TextRange with default values for start and length. |
| Public method | TextRange(TextRange) | Constructs a copy of the input TextRange object. |
| Public method | TextRange(Int32, Int32) | Constructs a TextRange with input start and length. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  TextRange |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | End | The index of the first character after the end of the range |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Length | The length of the range. |
| Public property | Start | The start index of a range within the  FormattedText  . |

# See Also

TextRange Class

Autodesk.Revit.DB Namespace